# ReloadLatestOptions Class

---
Options to control behavior of pure reload latest (not part of synchronize with central).
SystemObject Autodesk.Revit.DBReloadLatestOptions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ReloadLatestOptions : IDisposable

    Public Class ReloadLatestOptions
    	Implements IDisposable

    public ref class ReloadLatestOptions : IDisposable

    type ReloadLatestOptions =
        class
            interface IDisposable
        end
The ReloadLatestOptions type exposes the following members.
| Name| Description
---|---|---
| ReloadLatestOptions|  Constructs a new ReloadLatestOptions object.
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ReloadLatestOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace